In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("Monthlydata_32.713_-4.934_SA2_2005_2005.csv", sep="\t", header=[3]).head(12)
df = df.loc[:, ["year", "month","H(h)_m", "T2m"]]

In [3]:
df.to_csv("archivo.csv", sep=";")

In [4]:
df

    year month  H(h)_m   T2m
0   2005   Jan  117.34   1.9
1   2005   Feb  115.77   3.0
2   2005   Mar  162.75   9.9
3   2005   Apr  208.00  14.2
4   2005   May  228.02  19.5
5   2005   Jun  215.79  22.1
6   2005   Jul  227.21  25.0
7   2005   Aug  218.62  24.5
8   2005   Sep  184.90  18.9
9   2005   Oct  138.95  14.8
10  2005   Nov  105.56   7.5
11  2005   Dec  101.46   4.5